Repository: OleksiyBodnia/my-site-cv
Catalog: src/localization/*/messages.po
Languages: uk

source: Vadym bezsmertnyi
uk: Вадим Безсмертний

source: Design by @meellovve
uk: Дизайн від @meellovve

source: Vadym
uk: Вадим

source: Bezsmertnyi
uk: Безсмертний

source: Soft skills
uk: М'які навички

source: I am an experienced Front-end Developer specializing in ReactJS/React Native, TypeScript, Redux, and Testing.
uk: Я досвідчений фронтенд-розробник, спеціалізуюся на ReactJS/React Native, TypeScript, Redux та тестуванні.

source: With a strong background in web development, I have a proven track record of creating user-friendly and visually appealing interfaces.
uk: З міцним досвідом у веб-розробці у мене є підтверджена успішна практика створення дружніх для користувачів та візуально привабливих інтерфейсів.

source: I am passionate about staying up-to-date with the latest technologies and industry trends to deliver high-quality and efficient solutions.
uk: Я палко цікавлюся останніми технологіями та тенденціями в галузі, щоб надавати високоякісні та ефективні рішення.

source: I thrive in collaborative environments and enjoy working with cross-functional teams to bring ideas to life.
uk: Мені подобається працювати в командному середовищі та співпрацювати з колегами з різних напрямків для втілення ідей у реальність.

source: HARD SKILLS
uk: ТЕХНІЧНІ НАВИЧКИ

source: React Native and Front End Developer websites, Mobile Apps and Business Logic
uk: Розробник React Native та Front End: вебсайти, мобільні додатки та бізнес-логіка

source: websites
uk: вебсайти

source: I create modern websites with elegant design and high performance. My professional approach to website development ensures an excellent user experience.
uk: Я створюю сучасні вебсайти з елегантним дизайном та високою продуктивністю. Мій професійний підхід до розробки вебсайтів забезпечує відмінний користувацький досвід.

source: mobile apps
uk: мобільні додатки

source: I develop mobile apps for iOS and Android with a user-friendly interface and high speed.My apps combine modernd design with functionality to meet users' needs.
uk: Я розробляю мобільні додатки для iOS та Android з дружнім інтерфейсом користувача та високою швидкістю. Мої додатки поєднують сучасний дизайн з функціональністю, щоб задовольнити потреби користувачів.

source: I have experience in backend development using various services. I ensure the reliability, scalability, and security of your applications through the efficient use of databases and APIs.
uk: Я маю досвід у розробці backend за допомогою різних сервісів. Я гарантую надійність, масштабованість та безпеку ваших додатків за допомогою ефективного використання баз даних та API.

source: Developer
uk: Розробник

source: Vadym Bezsmertnyi
uk: Вадим Безсмертний

source: Home
uk: Головна

source: Hard Skills
uk: Професійні навички

source: Technical Skills
uk: Технічні навички

source: Soft Skills
uk: М'які навички

source: Contacts
uk: Контакти

source: More than 10 technical programming skills
uk: Більше ніж 10 технічних навичок програмування

source: Languages and Technologies: HTML5, XML, JavaScript (ES6+), Typescript, Web Sockets.
uk: Мови та технології: HTML5, XML, JavaScript (ES6+), TypeScript, Web Sockets.

source: Frameworks and Libraries: ReactJS (including Hooks, Router, and Lifecycle).
uk: Фреймворки та бібліотеки: ReactJS (включаючи Hooks, Router і Lifecycle).

source: Form and Server Interaction: React Tools (Formik, Axios, and others).
uk: Форми та взаємодія з сервером: інструменти React (Formik, Axios та інші).

source: Development Tools: Git, GitHub, GitLab, Bitbucket, Docker, Developer Tools, Webpack, CI/CD.
uk: Інструменти розробки: Git, GitHub, GitLab, Bitbucket, Docker, Developer Tools, Webpack, CI/CD.

source: State Management: Context, Redux, Middleware (Thunk, Redux-Saga), Reduxtoolkit.
uk: Управління станом: Context, Redux, Middleware (Thunk, Redux-Saga), Redux Toolkit.

source: NextJS, Intermediate Material UI, Bootstrap, jQuery, React Native and Expo.
uk: NextJS, середній рівень володіння Material UI, Bootstrap, jQuery, React Native та Expo.

source: Testing: Cypress, Jest, Jest snapshot.
uk: Тестування: Cypress, Jest, Jest Snapshot.

source: ChatGPT/OpenAI Other Skills:
uk: Інші навички ChatGPT/OpenAI:

source: Working with REST API.
uk: Робота з REST API.

source: Management tools: Jira.
uk: Інструменти управління: Jira.

source: Design and Prototyping: Wireframe (Photoshop, Figma, Zeplin, Avocode)
uk: Дизайн та прототипування: Wireframe (Photoshop, Figma, Zeplin, Avocode)

source: Strong analytical and problem-solving skills.
uk: Сильні аналітичні та навички розв'язування проблем.

source: Familiarity with Lingui, Husky, Zod, SSR, Utility types.
uk: Знайомство з Lingui, Husky, Zod, SSR, Utility types.

source: technical skills
uk: Технічні навички

source: Privacy Policy
uk: Політика конфіденційності

source: Terms of Use
uk: Умови використання
